p2fx-rails/app/controllers/iquber_controller.rb

SELECT "users".* FROM "users"
---
  def users
    @users=User.all