p2fx-rails/app/controllers/sips_controller.rb

  def index
    @sips = Sip.all
---
SELECT "sips".* FROM "sips"

  def show
    @sip = Sip.find(params[:id])
---
SELECT "sips".* FROM "sips" WHERE "sips"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @sip = Sip.find(params[:id])
---
SELECT "sips".* FROM "sips" WHERE "sips"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @sip = Sip.new(params[:sip])

    respond_to do |format|
      if @sip.save
---
INSERT INTO "sips" ("category", "contact", "created_at", "lat", "lon", "name", "pushed", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @sip = Sip.find(params[:id])
---
SELECT "sips".* FROM "sips" WHERE "sips"."id" = ? LIMIT 1  [["id", "1"]]